<?php

	// 1. echoを使ってHello Worldと出力してください
	echo 'Hello Workd';

	// 2. brを使って改行を出力してください
	echo '<br>';

	// 3. .を使って文字を連結して出力してください


	// 4. hrを使って水平線を出力してください


	// 5. phpの基本構文5つ連番リストで出力してください


	// 6. countryという変数を作成し、大日本帝国という文字列を代入してください


	// 7. 変数countryの中身を出力してください


	// 8. countryという変数に日本という文字列を上書きしてください


	// 9. 変数countryの中身を出力してください


	// 10. 変数first_nameとlast_nameを作成し、変数full_nameにまとめて格納してください


	// 11. 変数full_nameの中身を半角スペース付きで出力してください


	// 12. 変数colorに文字列を改行付きで代入してください


	// 13. 変数colorの中身を出力してください


	// 14. 変数colorを出力してください(中身は出力しません)


	// 15. hrを使って水平線を出力してください


	// 16. 変数ageに整数を代入してください


	// 17. 変数ageの中身を改行付きで出力してください


	// 18. 変数pieに浮動小数点型の数を代入してください


	// 19. 変数pieの中身を改行付きで出力してください


	// 20. 2+2, 2-2, 2×2, 2÷2, 5÷3のあまりを出力してください


	// 21. 変数tenに10, 変数fiveに5を代入してください


	// 22. 変数tenと変数fiveを掛け算し、答えを改行付きで出力してください


	// 23. hrを使って水平線を出力してください


	// 24. phpの基本構文2つ目を改行付きで出力してください


	// 25. 配列languageにEnglish, Spanish, French, Japanese, Aussieを代入してください


	// 26. 配列languageのEnglishを改行付きで出力してください


	// 27. 配列languageのSpanishを改行付きで出力してください


	// 28. 変数intを作成し、整数2を代入してください


	// 29. 配列languageと変数intを組み合わせて、Frenchを改行付きで出力してください


	// 30. 配列languageをvar_dumpして中身をすべて出力してください


	// 31. hrを使って水平線を出力してください


	// 32. phpの基本構文3つ目を改行付きで出力してください


	// 33. 配列languageのindex番号0がEnglishのとき改行付きでHelloと出力してください


	// 34. 条件を変更し、elseifを使って、配列languageのindex番号1がSpanishのとき改行付きでHolaと出力してください


	// 35. 条件を変更し、elseを使って、言語が合っていませんと出力してください


	// 36. AとBが等しいのであれば の比較演算子を改行付きで出力してください


	// 37. AとBが等しくなければ の比較演算子を改行付きで出力してください


	// 38. AがB以上の場合 の比較演算子を改行付きで出力してください


	// 39. AがBより大きい場合 の比較演算子を改行付きで出力してください


	// 40. AがB以下の場合 の比較演算子を改行付きで出力してください


	// 41. AがBより小さい場合 の比較演算子を改行付きで出力してください


	// 42. if文を使ってtrueのときの処理、falseのときの処理をそれぞれ改行付きで出力してください


	// 43. hrを使って水平線を出力してください


	// 44. phpの基本構文4つ目を改行付きで出力してください


	// 45. for文を使って1~10までの数字を半角スペース付きで出力してください


	// 46. 改行してください


	// 47. 変数timesを作成し、変数timesとfor文を使って$iを出力してください


	// 48. 配列nexseedを作成し、中身をfor文を使って全部改行付きで出力してください


	// 49. 配列nexseedの中に入っているデータ数をcount関数を使って改行付きで出力してください


	// 50. hrを使って水平線を出力してください


	// 51. phpの基本構文5つ目を改行付きで出力してください


	// 52. 連想配列profileを作成し、name, age, genderというkeyを持たせ、値を設定してください


	// 53. 連想配列profileのnameを出力してください


	// 54. 連想配列friend1, friend2 .... を作成し、それぞれname, ageというkeyを持たせ、値を設定してください


	// 55. 二次元配列allFriendsを作成し、連想配列friend1, friend2 .... を代入してください


	// 56. allFriendsのindex番号0のnameを改行付きで出力してください


	// 57. allFriendsのindex番号1のageを改行付きで出力してください


	// 58. 下記連想配列を代入した二次元配列があります。foreach文を使って改行付きですべての値を出力してください

	$areas1 = array('asia' => 'asia1', 'euro' => 'euro1', 'america' => 'america1');
	$areas2 = array('asia' => 'asia2', 'euro' => 'euro2', 'america' => 'america2');
	$areas3 = array('asia' => 'asia3', 'euro' => 'euro3', 'america' => 'america3');
	$allArea = array($areas1, $areas2, $areas3);


	// 59. 三次元配列を作成し、foreachで全て取得し、全て改行付きで出力してください


	// 60. 変数$i = 100; を用意し、100から1まで1つずつカウントダウンするプログラムを改行付きで作成してください


	// 61. for文を使って1~9までの4の倍数を改行付きで出力して下さい


	// 62. 1から100までの数を出力するプログラムを作成してください。ただし3の倍数のときは数の代わりに｢Fizz｣と、5の倍数のときは｢Buzz｣と出力し、3と5両方の倍数の場合には｢FizzBuzz｣と出力すること。


	// 63. 下記のような配列変数「alpha」があります。この配列のうち、'A'という文字が何回登場してくるか計算して結果を出力してください。
	$alpha = array('E', 'A', 'D', 'B', 'A', 'C', 'A', 'B', 'E', 'E', 'A', 'A', 'C');


?>

